Revit 2026 API

# WorksetId Properties

---

The WorksetId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntegerValue | Provides the value of the WorksetId as an integer. |
|  | InvalidWorksetId | Get the invalid WorksetId whose IntegerValue is -1. |

#### Reference

WorksetId Class

Autodesk.Revit.DB Namespace